{
  "recordId": null,
  "success": true,
  "objectName": "Vicky Dashboard",
  "records": [
    {
      "id": "User Id",
      "name": "Mark Smith",
      "progress": 56,
      "dimensions": [
        {
          "id": "03060552-71ae-4ba4-89bc-6784c4b428c7",
          "name": "Intellectual",
          "description": "The development of the intellectual dimension facilitates the building and expansion of your child's cognitive processes. This includes their ability to analyze and evaluate information in a meaningful way, build a knowledge base, think abstractly and rationally, acquire language skills, pursue academics, learn art, and more.",
          "alert": "Some Alert Text",
          "progress": 76,
          "sequence": 1
        },
        {
          "id": "f0a356fe-0042-4f75-b778-05901dc7fbf2",
          "name": "Physical",
          "description": "The development of the physical dimension supports your child in achieving their physical growth milestones, developing healthy habits, boosting attention and memory, building endurance, and improving long-term health. Consequently, they can realize their human potential and better manage the physiological and biological changes they experience during various stages of their life.",
          "alert": "Some Alert Text",
          "progress": 20,
          "sequence": 2
        },
        {
          "id": "f83a9d8d-c582-4a38-bcc8-cd542a9400b7",
          "name": "Emotional",
          "description": "From developing a strong sense of self, building an awareness of their emotions, expressing and managing their feelings, to developing coping mechanisms to deal with triggers, with the development of their emotional dimension, your child can grow into a balanced individual capable of navigating the uncertainties of life.",
          "alert": "Some Alert Text",
          "progress": 40,
          "sequence": 3
        },
        {
          "id": "d74e3448-5442-4ab2-b492-de6f64b53d2b",
          "name": "Spiritual",
          "description": "By developing their spiritual dimension, your child can find their purpose in life, think and act ethically, feel a sense of connection and spiritual fulfillment, live authentically, and cultivate gratitude to cope better with life's stresses and safeguard their mental health from an early age.",
          "alert": "Some Alert Text",
          "progress": 26,
          "sequence": 5
        },
        {
          "id": "934d922d-014e-40c4-a460-4a93718fdd08",
          "name": "Social",
          "description": "Growth along the social dimension is vital for your child's well-being and success in all aspects of their life. It encourages them to cooperate, connect with others, resolve conflict, contribute to communities, and make constructive choices and responsible decisions.",
          "alert": "some text here",
          "progress": 74,
          "sequence": 3
        }
      ]
    }
  ],
  "statusCode": 200,
  "message": "",
  "recordsCount": 1
}
